In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../original_data/tb.csv')
df.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df.describe(include='all')

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
count,5746,5769.000000,3081.000000,392.000000,401.000000,2381.000000,2407.000000,2408.000000,2415.000000,2421.000000,...,393.000000,404.000000,2378.000000,2394.000000,2400.000000,2398.000000,2401.000000,2394.000000,2396.000000,272.000000
unique,212,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,CO,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,1994.229329,9089.718922,8.806122,28.975062,79.438051,922.364769,1301.894518,1205.566046,983.515489,...,6.417303,39.185644,106.341043,758.737260,856.087500,586.597998,400.376510,276.178363,255.307596,2.540441
std,NaN,8.423265,38612.097933,46.094789,127.881505,280.489536,4278.638975,5253.398971,5409.064589,4780.782748,...,39.630100,170.491532,435.889885,3153.018686,3295.220001,2293.956123,1589.955543,1191.728829,1138.763846,38.261653
min,NaN,1980.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,NaN,1987.000000,97.000000,0.000000,0.000000,0.000000,10.000000,15.000000,16.000000,13.000000,...,0.000000,0.000000,1.000000,8.000000,10.000000,7.000000,5.000000,4.000000,5.000000,0.000000
50%,NaN,1994.000000,1017.000000,0.000000,1.000000,6.000000,92.000000,151.500000,134.000000,98.000000,...,0.000000,2.000000,7.000000,68.000000,86.000000,59.000000,38.000000,25.000000,29.000000,0.000000
75%,NaN,2002.000000,4985.000000,2.000000,8.000000,36.000000,511.500000,728.000000,591.500000,434.000000,...,1.000000,13.250000,50.000000,427.000000,477.500000,309.000000,216.000000,144.750000,124.000000,0.000000
max,NaN,2008.000000,615977.000000,655.000000,1519.000000,4648.000000,77121.000000,83850.000000,90498.000000,78815.000000,...,620.000000,2062.000000,8319.000000,51485.000000,49887.000000,33664.000000,21486.000000,18203.000000,21339.000000,631.000000

In [4]:
testresult_sex_agemin_agemax = {
    'new_sp': ('sp', None, None, None),
    'new_sp_m04': ('sp', 'm', 0, 4),
    'new_sp_m514': ('sp', 'm', 5, 14),
    'new_sp_m014': ('sp', 'm', 0, 14),
    'new_sp_m1524': ('sp', 'm', 15, 24),
    'new_sp_m2534': ('sp', 'm', 25, 34),
    'new_sp_m3544': ('sp', 'm', 35, 44),
    'new_sp_m4554': ('sp', 'm', 45, 54),
    'new_sp_m5564': ('sp', 'm', 55, 64),
    'new_sp_m65': ('sp', 'm', 65, None),
    'new_sp_mu': ('sp', 'm', None, None),
    'new_sp_f04': ('sp', 'f', 0, 4),
    'new_sp_f514': ('sp', 'f', 5, 14),
    'new_sp_f014': ('sp', 'f', 0, 14),
    'new_sp_f1524': ('sp', 'f', 15, 24),
    'new_sp_f2534': ('sp', 'f', 25, 34),
    'new_sp_f3544': ('sp', 'f', 35, 44),
    'new_sp_f4554': ('sp', 'f', 45, 54),
    'new_sp_f5564': ('sp', 'f', 55, 64),
    'new_sp_f65': ('sp', 'f', 65, None),
    'new_sp_fu': ('sp', 'f', None, None)
}

test_result = {k: v[0] for k, v in testresult_sex_agemin_agemax.items()}
sex = {k: v[1] for k, v in testresult_sex_agemin_agemax.items()}
age_min = {k: v[2] for k, v in testresult_sex_agemin_agemax.items()}
age_max = {k: v[3] for k, v in testresult_sex_agemin_agemax.items()}

In [5]:
# Zamiana kolumn na wiersze
tidified = df.melt(id_vars=['iso2', 'year']).dropna()

# Rozbicie kolumny zawierającej grupy na jej cztery składowe
tidified['test_result'] = tidified['variable'].map(test_result).astype(pd.StringDtype())
tidified['sex'] = tidified['variable'].map(sex).astype(pd.StringDtype())
tidified['min_age'] = tidified['variable'].map(age_min).astype(pd.Int16Dtype())
tidified['max_age'] = tidified['variable'].map(age_max).astype(pd.Int16Dtype())
# Zmiana nazwy kolumny zawierającej liczbę testów i dopasowanie jej typu danych do liczb całkowitych
tidified['new_cnt'] = tidified['value'].astype(pd.Int64Dtype())

# Pozbycie się zbędnych kolumn wynikających z wykonania metody df.melt(...)
tidified.drop('variable', axis=1, inplace=True)
tidified.drop('value', axis=1, inplace=True)

tidified.describe(include='all')

,iso2,year,test_result,sex,min_age,max_age,new_cnt
count,38619,38619.000000,38619,35552,35009.000000,30233.000000,38619.000000
unique,212,NaN,1,2,NaN,NaN,NaN
top,CA,NaN,sp,m,NaN,NaN,NaN
freq,449,NaN,38619,17821,NaN,NaN,NaN
mean,NaN,2001.895958,NaN,NaN,32.896255,37.477326,1286.248712
std,NaN,4.423605,NaN,NaN,21.646452,17.940694,11581.386826
min,NaN,1980.000000,NaN,NaN,0.000000,4.000000,0.000000
25%,NaN,1998.000000,NaN,NaN,15.000000,24.000000,5.000000
50%,NaN,2002.000000,NaN,NaN,35.000000,34.000000,44.000000
75%,NaN,2006.000000,NaN,NaN,55.000000,54.000000,315.000000
max,NaN,2008.000000,NaN,NaN,65.000000,64.000000,615977.000000

In [6]:
# #   Column
# ---  ------
#  0   iso2        - kod iso2 kraju z którego pochodzą dane
#  1   year        - rok z którego pochodzą dane
#  2   test_result - wynik testu (sp - pozytywny)
#  3   sex         - płeć
#  4   min_age     - początek przedziału wiekowego
#  5   max_age     - koniec przedziału wiekowego
#  6   new_cnt     - liczba nowych przypadków
tidified.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38619 entries, 4 to 121148
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   iso2         38619 non-null  object
 1   year         38619 non-null  int64
 2   test_result  38619 non-null  string
 3   sex          35552 non-null  string
 4   min_age      35009 non-null  Int16
 5   max_age      30233 non-null  Int16
 6   new_cnt      38619 non-null  Int64
dtypes: Int16(2), Int64(1), int64(1), object(1), string(2)
memory usage: 2.0+ MB

In [7]:
tidified.head()

  iso2  year test_result   sex  min_age  max_age  new_cnt
4   AD  1993          sp  <NA>     <NA>     <NA>       15
5   AD  1994          sp  <NA>     <NA>     <NA>       24
6   AD  1996          sp  <NA>     <NA>     <NA>        8
7   AD  1997          sp  <NA>     <NA>     <NA>       17
8   AD  1998          sp  <NA>     <NA>     <NA>        1

In [8]:
# Wypisanie zawartości przekształconej tabeli do nowego pliku CSV
tidified.to_csv('../analysis_data/tidy_tb.csv', index=False)